bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/XMEGA/ATXMEGA192A3.xml
                </instance>
            </module>
            <module name="PMIC" id="I6057">
                <instance name="PMIC">
                    <register-group address-space="data" offset="0x00A0" name-in-module="PMIC" name="PMIC"/>
                </instance>
            </module>
            <module name="DMA" id="I3000">
                <instance name="DMA">
                    <register-group address-space="data" offset="0x0100" name-in-module="DMA" name="DMA"/>
                </instance>
            </module>
            <module name="EVSYS" id="I6061">
                <instance name="EVSYS">
                    <register-group address-space="data" offset="0x0180" name-in-module="EVSYS" name="EVSYS"/>
                </instance>
            </module>
            <module name="NVM" id="I6076">
                <instance name="NVM">
                    <register-group address-space="data" offset="0x01C0" name-in-module="NVM" name="NVM"/>
                </instance>
                <instance name="FUSE">
                    <register-group address-space="fuses" offset="0x00" name-in-module="NVM_FUSES" name="FUSE"/>
                </instance>
                <instance name="LOCKBIT">
                    <register-group address-space="lockbits" offset="0x00" name-in-module="NVM_LOCKBITS"
                                    name="LOCKBIT"/>
                </instance>
                <instance name="PROD_SIGNATURES">
                    <register-group address-space="prod_signatures" offset="0x00"
                                    name-in-module="NVM_PROD_SIGNATURES" name="PROD_SIGNATURES"/>
                </instance>
            </module>
            <module name="AC" id="I6077">
                <instance name="ACA">
                    <register-group address-space="data" offset="0x0380" name-in-module="AC" name="ACA"/>
                </instance>
                <instance name="ACB">
                    <register-group address-space="data" offset="0x0390" name-in-module="AC" name="ACB"/>
                </instance>
            </module>
            <module name="ADC" id="I6064">
                <instance name="ADCA">
                    <register-group address-space="data" offset="0x0200" name-in-module="ADC" name="ADCA"/>
                </instance>
                <instance name="ADCB">
                    <register-group address-space="data" offset="0x0240" name-in-module="ADC" name="ADCB"/>
                </instance>
            </module>
            <module name="DAC" id="I6059">
                <instance name="DACB">
                    <register-group address-space="data" offset="0x0320" name-in-module="DAC" name="DACB"/>
                </instance>
            </module>
            <module name="RTC" id="I6093">
                <instance name="RTC">
                    <register-group address-space="data" offset="0x0400" name-in-module="RTC" name="RTC"/>
                </instance>
            </module>
            <module name="TWI" id="I6089">
                <instance name="TWIC">
                    <register-group address-space="data" offset="0x480" name-in-module="TWI" name="TWIC"/>
                </instance>
                <instance name="TWIE">
                    <register-group address-space="data" offset="0x4A0" name-in-module="TWI" name="TWIE"/>
                </instance>
            </module>
            <module name="PORT" id="I6075">
                <instance name="PORT_CFG">
                    <register-group address-space="data" offset="0x00B0" name-in-module="PORTCFG" name="PORTCFG"/>
                </instance>
                <instance name="VPORT0">
                    <register-group address-space="data" offset="0x0010" name-in-module="VPORT" name="VPORT0"/>
                </instance>
                <instance name="VPORT1">
                    <register-group address-space="data" offset="0x0014" name-in-module="VPORT" name="VPORT1"/>
                </instance>
                <instance name="VPORT2">
                    <register-group address-space="data" offset="0x0018" name-in-module="VPORT" name="VPORT2"/>
                </instance>
                <instance name="VPORT3">
                    <register-group address-space="data" offset="0x001C" name-in-module="VPORT" name="VPORT3"/>
                </instance>
                <instance name="PORTA">
                    <register-group address-space="data" offset="0x0600" name-in-module="PORT" name="PORTA"/>
                    <signals>
                        <signal function="PORTA" group="P" index="0" pad="PA0"/>
                        <signal function="PORTA" group="P" index="1" pad="PA1"/>
                        <signal function="PORTA" group="P" index="2" pad="PA2"/>
                        <signal function="PORTA" group="P" index="3" pad="PA3"/>
                        <signal function="PORTA" group="P" index="4" pad="PA4"/>
                        <signal function="PORTA" group="P" index="5" pad="PA5"/>
                        <signal function="PORTA" group="P" index="6" pad="PA6"/>
                        <signal function="PORTA" group="P" index="7" pad="PA7"/>
                    </signals>
                </instance>
                <instance name="PORTB">
                    <register-group address-space="data" offset="0x0620" name-in-module="PORT" name="PORTB"/>
                    <signals>
                        <signal function="PORTB" group="P" index="0" pad="PB0"/>
                        <signal function="PORTB" group="P" index="1" pad="PB1"/>
                        <signal function="PORTB" group="P" index="2" pad="PB2"/>
                        <signal function="PORTB" group="P" index="3" pad="PB3"/>
                        <signal function="PORTB" group="P" index="4" pad="PB4"/>
                        <signal function="PORTB" group="P" index="5" pad="PB5"/>
                        <signal function="PORTB" group="P" index="6" pad="PB6"/>
                        <signal function="PORTB" group="P" index="7" pad="PB7"/>
                    </signals>
                </instance>
