bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/XMEGA/ATXMEGA192A3.xml
                <register caption="Device ID byte 2" name="DEVID2" offset="0x02" size="1"/>
                <register caption="Revision ID" name="REVID" offset="0x03" size="1"/>
                <register caption="JTAG User ID" name="JTAGUID" offset="0x04" size="1"/>
                <register caption="MCU Control" name="MCUCR" offset="0x06" size="1">
                    <bitfield caption="JTAG Disable" mask="0x01" name="JTAGD"/>
                </register>
                <register caption="Event System Lock" name="EVSYSLOCK" offset="0x08" size="1">
                    <bitfield caption="Event Channel 4-7 Lock" mask="0x10" name="EVSYS1LOCK"/>
                    <bitfield caption="Event Channel 0-3 Lock" mask="0x01" name="EVSYS0LOCK"/>
                </register>
                <register caption="AWEX Lock" name="AWEXLOCK" offset="0x09" size="1">
                    <bitfield caption="AWeX on T/C E0 Lock" mask="0x04" name="AWEXELOCK"/>
                    <bitfield caption="AWeX on T/C C0 Lock" mask="0x01" name="AWEXCLOCK"/>
                </register>
            </register-group>
        </module>
        <module name="PMIC" caption="Programmable Multi-level Interrupt Controller" id="I6057">
            <register-group name="PMIC" caption="Programmable Multi-level Interrupt Controller" size="16">
                <register name="STATUS" caption="Status Register" size="1" offset="0x00">
                    <bitfield name="NMIEX" caption="Non-maskable Interrupt Executing" mask="0x80"/>
                    <bitfield name="HILVLEX" caption="High Level Interrupt Executing" mask="0x04"/>
                    <bitfield name="MEDLVLEX" caption="Medium Level Interrupt Executing" mask="0x02"/>
                    <bitfield name="LOLVLEX" caption="Low Level Interrupt Executing" mask="0x01"/>
                </register>
                <register name="INTPRI" caption="Interrupt Priority" size="1" offset="0x01">
                    <bitfield name="INTPRI" caption="Interrupt Priority" mask="0xFF"/>
                </register>
                <register name="CTRL" caption="Control Register" size="1" offset="0x02">
                    <bitfield name="RREN" caption="Round-Robin Priority Enable" mask="0x80"/>
                    <bitfield name="IVSEL" caption="Interrupt Vector Select" mask="0x40"/>
                    <bitfield name="HILVLEN" caption="High Level Enable" mask="0x04"/>
                    <bitfield name="MEDLVLEN" caption="Medium Level Enable" mask="0x02"/>
                    <bitfield name="LOLVLEN" caption="Low Level Enable" mask="0x01"/>
                </register>
            </register-group>
        </module>
        <module name="DMA" id="I3000" caption="DMA Controller">
            <register-group caption="DMA Channel" name="DMA_CH" size="16">
                <register caption="Channel Control" name="CTRLA" offset="0x00" size="1">
                    <bitfield caption="Channel Enable" mask="0x80" name="ENABLE"/>
                    <bitfield caption="Channel Software Reset" mask="0x40" name="RESET"/>
                    <bitfield caption="Channel Repeat Mode" mask="0x20" name="REPEAT"/>
                    <bitfield caption="Channel Transfer Request" mask="0x10" name="TRFREQ"/>
                    <bitfield caption="Channel Single Shot Data Transfer" mask="0x04" name="SINGLE"/>
                    <bitfield caption="Channel Transfer Mode" mask="0x03" name="BURSTLEN" values="DMA_CH_BURSTLEN"/>
                </register>
                <register caption="Channel Control" name="CTRLB" offset="0x01" size="1">
                    <bitfield caption="Block Transfer Busy" mask="0x80" name="CHBUSY"/>
                    <bitfield caption="Block Transfer Pending" mask="0x40" name="CHPEND"/>
                    <bitfield caption="Block Transfer Error Interrupt Flag" mask="0x20" name="ERRIF"/>
                    <bitfield caption="Transaction Complete Interrupt Flag" mask="0x10" name="TRNIF"/>
                    <bitfield caption="Transfer Error Interrupt Level" mask="0x0C" name="ERRINTLVL"
                              values="DMA_CH_ERRINTLVL"/>
                    <bitfield caption="Transaction Complete Interrupt Level" mask="0x03" name="TRNINTLVL"
                              values="DMA_CH_TRNINTLVL"/>
                </register>
                <register caption="Address Control" name="ADDRCTRL" offset="0x02" size="1">
                    <bitfield caption="Channel Source Address Reload" mask="0xC0" name="SRCRELOAD"
                              values="DMA_CH_SRCRELOAD"/>
                    <bitfield caption="Channel Source Address Mode" mask="0x30" name="SRCDIR" values="DMA_CH_SRCDIR"/>
                    <bitfield caption="Channel Destination Address Reload" mask="0x0C" name="DESTRELOAD"
                              values="DMA_CH_DESTRELOAD"/>
                    <bitfield caption="Channel Destination Address Mode" mask="0x03" name="DESTDIR"
                              values="DMA_CH_DESTDIR"/>
                </register>
                <register caption="Channel Trigger Source" name="TRIGSRC" offset="0x03" size="1">
                    <bitfield caption="Channel Trigger Source" mask="0xFF" name="TRIGSRC" values="DMA_CH_TRIGSRC"/>
                </register>
                <register caption="Channel Block Transfer Count" name="TRFCNT" offset="0x04" size="2"/>
                <register caption="Channel Repeat Count" name="REPCNT" offset="0x06" size="1"/>
                <register caption="Channel Source Address 0" name="SRCADDR0" offset="0x08" size="1"/>
                <register caption="Channel Source Address 1" name="SRCADDR1" offset="0x09" size="1"/>
                <register caption="Channel Source Address 2" name="SRCADDR2" offset="0x0A" size="1"/>
                <register caption="Channel Destination Address 0" name="DESTADDR0" offset="0x0C" size="1"/>
                <register caption="Channel Destination Address 1" name="DESTADDR1" offset="0x0D" size="1"/>
                <register caption="Channel Destination Address 2" name="DESTADDR2" offset="0x0E" size="1"/>
            </register-group>
            <register-group caption="DMA Controller" name="DMA" size="80">
                <register caption="Control" name="CTRL" offset="0x00" size="1">
                    <bitfield caption="Enable" mask="0x80" name="ENABLE"/>
                    <bitfield caption="Software Reset" mask="0x40" name="RESET"/>
                    <bitfield caption="Double Buffering Mode" mask="0x0C" name="DBUFMODE" values="DMA_DBUFMODE"/>
                    <bitfield caption="Channel Priority Mode" mask="0x03" name="PRIMODE" values="DMA_PRIMODE"/>
                </register>
                <register caption="Transfer Interrupt Status" name="INTFLAGS" offset="0x03" size="1">
                    <bitfield caption="Channel 3 Block Transfer Error Interrupt Flag" mask="0x80" name="CH3ERRIF"/>
                    <bitfield caption="Channel 2 Block Transfer Error Interrupt Flag" mask="0x40" name="CH2ERRIF"/>
                    <bitfield caption="Channel 1 Block Transfer Error Interrupt Flag" mask="0x20" name="CH1ERRIF"/>
                    <bitfield caption="Channel 0 Block Transfer Error Interrupt Flag" mask="0x10" name="CH0ERRIF"/>
                    <bitfield caption="Channel 3 Transaction Complete Interrupt Flag" mask="0x08" name="CH3TRNIF"/>
                    <bitfield caption="Channel 2 Transaction Complete Interrupt Flag" mask="0x04" name="CH2TRNIF"/>
                    <bitfield caption="Channel 1 Transaction Complete Interrupt Flag" mask="0x02" name="CH1TRNIF"/>
                    <bitfield caption="Channel 0 Transaction Complete Interrupt Flag" mask="0x01" name="CH0TRNIF"/>
                </register>
                <register caption="Status" name="STATUS" offset="0x04" size="1">
                    <bitfield caption="Channel 3 Block Transfer Busy" mask="0x80" name="CH3BUSY"/>
                    <bitfield caption="Channel 2 Block Transfer Busy" mask="0x40" name="CH2BUSY"/>
                    <bitfield caption="Channel 1 Block Transfer Busy" mask="0x20" name="CH1BUSY"/>
                    <bitfield caption="Channel 0 Block Transfer Busy" mask="0x10" name="CH0BUSY"/>
                    <bitfield caption="Channel 3 Block Transfer Pending" mask="0x08" name="CH3PEND"/>
                    <bitfield caption="Channel 2 Block Transfer Pending" mask="0x04" name="CH2PEND"/>
                    <bitfield caption="Channel 1 Block Transfer Pending" mask="0x02" name="CH1PEND"/>
                    <bitfield caption="Channel 0 Block Transfer Pending" mask="0x01" name="CH0PEND"/>
                </register>
